Tekla.Structures.ModelInternal.dotCamera_t
View Camera struct

Tekla.Structures.ModelInternal.dotCamera_t.Location
Camera location in global coordinates (XYZ)

Tekla.Structures.ModelInternal.dotCamera_t.DirectionVector
Camera direction (Pan and Tilt)

Tekla.Structures.ModelInternal.dotCamera_t.UpVector
Camera up vector (Roll)

Tekla.Structures.ModelInternal.dotCamera_t.FieldOfView
Perspective view camera field of view

Tekla.Structures.ModelInternal.dotCamera_t.ZoomFactor
Otrogonal view camera zoom factor